eisup_2019_docmng_integration/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Префикс</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИМНС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныеУсловияПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ТерриториальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавокЕСНиПФР</name>
    <type>
      <types>EnumRef.ВидыСтавокЕСНиПФР</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПлательщикаПриПеречисленииНалогов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИностраннаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоНаименованиеОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоКодОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <comment>Заполняется в случае, если организация не российская</comment>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПостоянногоМестонахождения</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВСтранеРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИнострОрганизации</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерФСС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИМНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОНХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйПредприниматель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбменЗадействован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКодАбонента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКаталогОтправкиДанныхОтчетности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКаталогПрограммыЭлектроннойПочты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРФ</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВРегламентированномУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИФНСПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТерриториальногоОрганаПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбменаСКонтролирующимиОрганами</name>
    <type>
      <types>EnumRef.ВидыОбменаСКонтролирующимиОрганами</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОбмена</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиДокументооборота</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКодФСС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПодчиненностиФСС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТерриториальногоОрганаФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>135</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИспользоватьПрефиксВБиллинге</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусОрганизации</name>
    <type>
      <types>EnumRef.абс_СтатусОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПрефиксТаблицВTPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодРегиона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодИСУЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодРЖД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КонтрольОборотовПоДоговорам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыАСБ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЛоготип</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлФаксимильнаяПечать</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Enums/ВидыОбменаСКонтролирующимиОрганами/ВидыОбменаСКонтролирующимиОрганами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОбменаСКонтролирующимиОрганами</name>
  <enumValues>
    <name>ОбменОтключен</name>
  </enumValues>
  <enumValues>
    <name>ОбменВУниверсальномФормате</name>
  </enumValues>
  <enumValues>
    <name>ОбменЧерезСпринтер</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыСтавокЕСНиПФР/ВидыСтавокЕСНиПФР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтавокЕСНиПФР</name>
  <enumValues>
    <name>ДляСельскохозяйственныхПроизводителей</name>
  </enumValues>
  <enumValues>
    <name>ДляНеСельскохозяйственныхПроизводителей</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыАСБ/абс_СтатусыАСБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыАСБ</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНСИ</name>
  </enumValues>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Заполнение</name>
  </enumValues>
  <enumValues>
    <name>Сформирован</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеВыгрузки</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/Организации/ObjectModule.bsl
Перем ПрошлыйИзмененныйГоловнаяОрганизация;

Процедура ЗаполнитьРеквизитыОбъекта(Отказ, ТекстСообщенияОшибки)
	
	Если Не ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;	
	КонецЕсли;
		
	ТекстСообщенияОшибки = "";
	Если Ссылка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо И ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		ЗапросОрганизации = Новый Запрос;
		ЗапросОрганизации.УстановитьПараметр("ГоловнаяОрганизация", Ссылка);
		ЗапросОрганизации.Текст =
		"ВЫБРАТЬ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация";
		Если Не ЗапросОрганизации.Выполнить().Пустой() Тогда
			ТекстСообщенияОшибки = ОбщегоНазначения.ПреобразоватьСтрокуИнтерфейса("Организация не может быть индивидуальным предпринимателем, для неё зарегистрированы обособленные подразделения!") + Символы.ПС;
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И НЕ ЗначениеЗаполнено(ИндивидуальныйПредприниматель) Тогда
		ТекстСообщенияОшибки = ТекстСообщенияОшибки + ОбщегоНазначения.ПреобразоватьСтрокуИнтерфейса("Организации - индивидуальному предпринимателю не сопоставлено физ. лицо!") + Символы.ПС;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ИННОрг = ?(ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо, ИндивидуальныйПредприниматель.ИНН, ИНН);

	Если Ссылка.ИНН <> ИННОрг Тогда
		Если НЕ ПустаяСтрока(ИННОрг) И НЕ РегламентированнаяОтчетность.ИННСоответствуетТребованиям(ИННОрг, ЮрФизЛицо) Тогда
			ТекстСообщенияОшибки = ТекстСообщенияОшибки +  "ИНН " + ОбщегоНазначения.ПреобразоватьСтрокуИнтерфейса("организации") + " задан неверно!" + Символы.ПС;
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ФизЛицо И Ссылка.КПП <> КПП Тогда
		Если НЕ ПустаяСтрока(КПП) И СтрДлина(КПП) <> 9 Тогда
			ОшибкаКПП = Не ОбщегоНазначенияПереопределяемый.КППОрганизацииСоответствуетТребованиям(КПП, ТекстСообщенияОшибки);
			Отказ = ?(ОшибкаКПП, ОшибкаКПП, Отказ);
		КонецЕсли;
	КонецЕсли;
	Если Ссылка.ОГРН <> ОГРН Тогда
		Если НЕ ПустаяСтрока(ОГРН) Тогда
			ОшибкаОГРН = Не ОбщегоНазначенияПереопределяемый.ОГРНСоответствуетТребованиям(ОГРН, ЮрФизЛицо, ТекстСообщенияОшибки);
			Отказ = ?(ОшибкаОГРН, ОшибкаОГРН, Отказ);
		КонецЕсли;
	КонецЕсли;
	Если ВидОбменаСКонтролирующимиОрганами = Перечисления.ВидыОбменаСКонтролирующимиОрганами.ОбменВУниверсальномФормате И УчетнаяЗаписьОбмена.Пустая() Тогда
		Отказ = Истина;
		ТекстСообщенияОшибки = ТекстСообщенияОшибки + "Не выбрана учетная запись для документооборота с ФНС!" + Символы.ПС;
	КонецЕсли;
	Если НЕ Отказ Тогда
		Если ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И ЗначениеЗаполнено(ИндивидуальныйПредприниматель) Тогда
			ИНН = ИндивидуальныйПредприниматель.ИНН;
		КонецЕсли;
		Если ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			КПП								= "";
			КодОКОНХ						= "";
			ГоловнаяОрганизация 			= Неопределено;
		ИначеЕсли ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			ИндивидуальныйПредприниматель 	= Неопределено;
		КонецЕсли;
		ИНН = СокрЛП(ИНН);
		ОГРН = СокрЛП(ОГРН);
		Если ВидОбменаСКонтролирующимиОрганами.Пустая() Тогда
			ВидОбменаСКонтролирующимиОрганами = Перечисления.ВидыОбменаСКонтролирующимиОрганами.ОбменОтключен;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначенияЗК.ПолучитьРабочуюДату() < ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами() И Не ЗначениеЗаполнено(ВидСтавокЕСНиПФР) Тогда
		ВидСтавокЕСНиПФР = Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей;	
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ПередЗаписью" Объекта
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		ТекстСообщенияОшибки = "";
		
		ЗаполнитьРеквизитыОбъекта(Отказ, ТекстСообщенияОшибки);
		
		Если Отказ Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщенияОшибки, Отказ);
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ПрошлыйИзмененныйГоловнаяОрганизация = ?(Не ЭтоНовый() и Не Ссылка.ГоловнаяОрганизация = ГоловнаяОрганизация, Ссылка.ГоловнаяОрганизация, Неопределено);
			НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, ГоловнаяОрганизация);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция записывает новое значение ИНН для обособленных организаций.
//
// Параметры
//
// Возвращаемое значение:
//   Строка   – пустая строка, если записали ИНН,
//				текст об ошибке, если ИНН не удалось записать. 
//
Функция ОбновитьИННОбособленныхОрганизаций()

	Если ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстСообщения = "";
	ЗапросОрганизации = Новый Запрос;
	ЗапросОрганизации.УстановитьПараметр("ГоловнаяОрганизация", Ссылка);
	ЗапросОрганизации.УстановитьПараметр("ИНН", ИНН);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|ГДЕ
	|	Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация И
	|	Организации.ИНН <> &ИНН";
	
	ЗапросОрганизации.Текст = ТекстЗапроса;
	ВыборкаЗапроса = ЗапросОрганизации.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		ОбособленнаяОрганизация = ВыборкаЗапроса.Ссылка.ПолучитьОбъект();
		Попытка
		    ОбособленнаяОрганизация.Заблокировать();
		Исключение
			ТекстСообщения = "Организация: " + ВыборкаЗапроса.Ссылка + " - объект заблокирован.";
			Возврат ТекстСообщения
		КонецПопытки;
	КонецЦикла;	    
	
	ВыборкаЗапроса.Сбросить(); 
	Пока ВыборкаЗапроса.Следующий() Цикл
		ОбособленнаяОрганизация = ВыборкаЗапроса.Ссылка.ПолучитьОбъект();
		ОбособленнаяОрганизация.ИНН = ИНН;
		ОбособленнаяОрганизация.Записать()
	КонецЦикла; 

	Возврат ТекстСообщения

КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗаписиИНН = ОбновитьИННОбособленныхОрганизаций();
	Если НЕ ПустаяСтрока(ТекстЗаписиИНН) Тогда
		Сообщить(ТекстЗаписиИНН + Символы.ПС + "Элемент не записан!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	НастройкаПравДоступа.ОбновитьПраваДоступаКИерархическимОбъектамПриНеобходимости(Ссылка, ПрошлыйИзмененныйГоловнаяОрганизация, Отказ);
	
	//АБС ВСТАВКА Навценя 05.03.2015
	РегистрыСведений.абс_ИсторияСтатусовАСБ.ЗаписатьСтатус(Ссылка, абс_Статус, ДополнительныеСвойства);
	//АБС ВСТАВКА КОНЕЦ
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ВидСтавокЕСНиПФР					= Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей;
	ЮрФизЛицо							= Перечисления.ЮрФизЛицо.ЮрЛицо;
	РайонныйКоэффициент					= 1;
	РайонныйКоэффициентРФ				= 1;
	ОтражатьВРегламентированномУчете	= Истина;
	
	абс_Статус = Перечисления.абс_СтатусыАСБ.Подготовка;
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	
	абс_Статус = Перечисления.абс_СтатусыАСБ.Подготовка;
	
КонецПроцедуры
